{"pageProps":{"post":{"mdxSource":"var Component=(()=>{var d=Object.create;var i=Object.defineProperty;var h=Object.getOwnPropertyDescriptor;var u=Object.getOwnPropertyNames;var f=Object.getPrototypeOf,p=Object.prototype.hasOwnProperty;var s=e=>i(e,\"__esModule\",{value:!0});var m=(e,a)=>()=>(a||e((a={exports:{}}).exports,a),a.exports),g=(e,a)=>{s(e);for(var o in a)i(e,o,{get:a[o],enumerable:!0})},w=(e,a,o)=>{if(a&&typeof a==\"object\"||typeof a==\"function\")for(let r of u(a))!p.call(e,r)&&r!==\"default\"&&i(e,r,{get:()=>a[r],enumerable:!(o=h(a,r))||o.enumerable});return e},y=e=>w(s(i(e!=null?d(f(e)):{},\"default\",e&&e.__esModule&&\"default\"in e?{get:()=>e.default,enumerable:!0}:{value:e,enumerable:!0})),e);var c=m((x,l)=>{l.exports=_jsx_runtime});var A={};g(A,{default:()=>k,frontmatter:()=>b});var t=y(c()),b={title:\"WAFs: The Magical Barriers of Cybersecurity\",date:\"2023-10-31\",tags:[\"Cloud\",\"AWS\",\"Azure\"],draft:!1,summary:\"Dive into the world of firewalls, understanding their function, exploring traditional and modern versions, and discovering the promising newcomer, Coraza, all through the lens of Japanese anime barriers.\",images:[]};function v(e={}){let{wrapper:a}=e.components||{};return a?(0,t.jsx)(a,Object.assign({},e,{children:(0,t.jsx)(o,{})})):o();function o(){let r=Object.assign({p:\"p\",a:\"a\"},e.components),{Image:n}=r;return n||z(\"Image\",!0),(0,t.jsxs)(t.Fragment,{children:[(0,t.jsxs)(r.p,{children:[\"I've been watching the Japanese anime 'Sousou no Frieren' lately, and at the same time, I've been reviewing the source code for \",(0,t.jsx)(r.a,{href:\"https://github.com/corazawaf/coraza\",children:\"Coraza\"}),\". It suddenly struck me \\u2013 isn't the magical world's barrier just like a web applicaion firewall?\"]}),(0,t.jsx)(r.p,{children:`In the world of Japanese anime, magical barriers, known as \"kekkai,\" are often used by heroes to protect themselves from monstrous threats. These barriers keep the monsters at bay, only allowing friendly entities to pass through. Now, imagine if we had something similar in the digital world to protect our systems from malicious attacks. Well, we do, and they're called firewalls.`}),(0,t.jsx)(n,{width:380,src:\"/static/images/general/sousou_waf.png\"}),(0,t.jsx)(r.p,{children:\"Firewalls function much like these anime barriers. They stand guard at the entrance to your network, scrutinizing incoming and outgoing traffic based on predetermined rules. Just like a barrier that keeps monsters out, a firewall fends off malicious requests, only allowing safe and approved data to pass through.\"}),(0,t.jsxs)(r.p,{children:[\"One of the traditional web firewalls that has long been a part of this frontline defense is ModSecurity. ModSecurity provides real-time application security monitoring and access control. It also offers features like virtual patching, comprehensive HTTP traffic logging, and web application hardening. It's like a fortified barrier bolstered with additional protective charms to ensure maximum security. However, the owner of ModSecurity announced the end of Support for ModSecurity for 2024(\",(0,t.jsx)(r.a,{href:\"https://www.trustwave.com/en-us/resources/security-resources/software-updates/end-of-sale-and-trustwave-support-for-modsecurity-web-application-firewall/\",children:\"refer: Trustwave's blog\"}),\").\"]}),(0,t.jsxs)(r.p,{children:[\"For general web defense requirements, cloud WAF solutions like AWS WAF or Azure WAF are often suitable. Nevertheless, as revealed in articles on \",(0,t.jsx)(r.a,{href:\"https://blog.fraktal.fi/cloud-waf-comparison-using-real-world-attacks-acb21d37805e\",children:\"Fraktal Blog\"}),\" and \",(0,t.jsx)(r.a,{href:\"https://blog.fraktal.fi/cloud-waf-comparison-part-2-e6e2d25f558c\",children:\"Fraktal Blog Part 2\"}),\", it's evident that Azure WAF was the clear winner and the only service that performed well in blocking real-world attacks in their test.\"]}),(0,t.jsxs)(r.p,{children:[\"However, the world of web firewalls is not limited to these options. A promising newcomer, Coraza, is stepping onto the scene, ready to make its mark. Coraza, as detailed in a blog titled \",(0,t.jsx)(r.a,{href:\"https://coreruleset.org/20211222/talking-about-modsecurity-and-the-new-coraza-waf/\",children:\"Talking about ModSecurity and the new Coraza WAF\"}),\" is a new contender in the web application firewall (WAF) landscape.\"]}),(0,t.jsx)(r.p,{children:\"Coraza is an implementation of a SecLang engine developed in Go language by Juan Pablo Tosso from Chile. Although it currently only works on the open-source Caddy web server, Coraza is already making waves by passing 100% of the CRS test suite, indicating it's ready for production.\"}),(0,t.jsxs)(r.p,{children:[\"The beauty of Coraza lies in its potential. It aims to become a drop-in replacement for ModSecurity and has plans for Apache and NGINX integration, among many other things. The only hurdle it faces is the lack of a developer community, but the project's potential and appeal may soon attract the needed support. And one more thing, the performance of the newly version of Coraza seems pretty good.(\",(0,t.jsx)(r.a,{href:\"https://coraza.io/docs/reference/benchmarks/\",children:\"refer: Coraza Benchmarks\"}),\")\"]}),(0,t.jsx)(r.p,{children:\"I firmly believe that there's plenty of room for both vendor-specific WAF solutions and open-source alternatives like Coraza to coexist for a long time.\"}),(0,t.jsx)(r.p,{children:\"For common web defense needs, the WAF solutions provided by cloud vendors such as AWS WAF or Azure WAF are often sufficient. These services offer comprehensive protection against a wide array of threats and integrate seamlessly with other services on their respective platforms. This makes them an excellent choice for businesses seeking a straightforward, all-in-one solution.\"}),(0,t.jsx)(r.p,{children:\"However, every business is unique, and some may have specific security requirements that aren't adequately addressed by these out-of-the-box solutions. This is where solutions like Coraza come into play. Coraza's flexibility and customizability make it an excellent choice for businesses with unique needs. With Coraza-like solutions, businesses can tailor their firewall to their specific requirements, ensuring that their unique security needs are met.\"})]})}}var k=v;function z(e,a){throw new Error(\"Expected \"+(a?\"component\":\"object\")+\" `\"+e+\"` to be defined: you likely forgot to import, pass, or provide it.\")}return A;})();\n;return Component;","toc":[],"frontMatter":{"readingTime":{"text":"4 min read","minutes":3.27,"time":196200,"words":654},"slug":"general/firewall_kekkai","fileName":"general/firewall_kekkai.md","title":"WAFs: The Magical Barriers of Cybersecurity","date":"2023-10-31T00:00:00.000Z","tags":["Cloud","AWS","Azure"],"draft":false,"summary":"Dive into the world of firewalls, understanding their function, exploring traditional and modern versions, and discovering the promising newcomer, Coraza, all through the lens of Japanese anime barriers.","images":[]}},"authorDetails":[{"readingTime":{"text":"1 min read","minutes":0.68,"time":40800,"words":136},"slug":["default"],"fileName":"default.md","name":"L.W.J","avatar":"/static/images/avatar.png","occupation":"CISSP, AWS Certified Security – Specialty, Microsoft Cybersecurity Architect Expert","email":"nerd@supasaf.com","twitter":"https://twitter.com/supasaf","date":null}],"prev":{"title":"AWS Security Specialty: What I Learned Preparing for the Exam","date":"2023-09-24T00:00:00.000Z","tags":["Cloud","AWS"],"draft":false,"summary":"Sharing my exam prep insights and key technical focus areas like IAM, KMS, and VPC to help others prepare for the AWS Security Specialty exam.","images":[],"slug":"general/aws_security_cert"},"next":null},"__N_SSG":true}