{"pageProps":{"post":{"mdxSource":"var Component=(()=>{var d=Object.create;var o=Object.defineProperty;var h=Object.getOwnPropertyDescriptor;var u=Object.getOwnPropertyNames;var p=Object.getPrototypeOf,m=Object.prototype.hasOwnProperty;var s=i=>o(i,\"__esModule\",{value:!0});var y=(i,r)=>()=>(r||i((r={exports:{}}).exports,r),r.exports),f=(i,r)=>{s(i);for(var n in r)o(i,n,{get:r[n],enumerable:!0})},g=(i,r,n)=>{if(r&&typeof r==\"object\"||typeof r==\"function\")for(let t of u(r))!m.call(i,t)&&t!==\"default\"&&o(i,t,{get:()=>r[t],enumerable:!(n=h(r,t))||n.enumerable});return i},S=i=>g(s(o(i!=null?d(p(i)):{},\"default\",i&&i.__esModule&&\"default\"in i?{get:()=>i.default,enumerable:!0}:{value:i,enumerable:!0})),i);var l=y((I,c)=>{c.exports=_jsx_runtime});var v={};f(v,{default:()=>A,frontmatter:()=>w});var e=S(l()),w={title:\"AWS Security Specialty: What I Learned Preparing for the Exam\",date:\"2023-09-24\",tags:[\"Cloud\",\"AWS\"],draft:!1,summary:\"Sharing my exam prep insights and key technical focus areas like IAM, KMS, and VPC to help others prepare for the AWS Security Specialty exam.\",images:[]};function b(i={}){let{wrapper:r}=i.components||{};return r?(0,e.jsx)(r,Object.assign({},i,{children:(0,e.jsx)(n,{})})):n();function n(){let t=Object.assign({p:\"p\",a:\"a\",ol:\"ol\",li:\"li\",ul:\"ul\"},i.components),{Image:a}=t;return a||C(\"Image\",!0),(0,e.jsxs)(e.Fragment,{children:[(0,e.jsx)(t.p,{children:\"Recently, I passed the AWS Certified Security \\u2013 Specialty exam.\"}),(0,e.jsx)(a,{width:600,src:\"/static/images/general/aws_cert_pass.png\"}),(0,e.jsx)(t.p,{children:\"The initially drawn to this test because I spotted a 50% discount on the exam fee.\"}),(0,e.jsx)(a,{width:600,src:\"/static/images/general/aws_cert_pass.png\"}),(0,e.jsx)(t.p,{children:'Just kidding:) The main reason was my desire to comprehensively learn about AWS security architecture. In my daily work, I deal with AWS/Ali/Azure cloud and on-premise hybrid cloud. While the documentation from these cloud vendors can solve most of the problems encountered in daily work, I sometimes wonder, \"Is this the best solution? Is the solution provided in the official document good enough?\". To gain a thorough understanding of every aspect of cloud computing security, I decided to take the AWS Certified Security \\u2013 Specialty exam to comprehend all the details of cloud security architecture.'}),(0,e.jsx)(t.p,{children:\"In this blog, I mainly want to share my exam preparation process, hoping to lend a hand to those preparing for this exam.\"}),(0,e.jsxs)(t.p,{children:[\"First, I want to mention Dylan Shields' book, \",(0,e.jsx)(t.a,{href:\"https://www.amazon.com/AWS-Security-Dylan-Shields/dp/161729733X\",children:\"AWS Security\"}),\". This book, combining theory and practice, introduces the main considerations for AWS security architecture design. My previous blog post \",(0,e.jsx)(t.a,{href:\"https://www.supasaf.com/blog/terraform/terraform_sec_2_iam1\",children:\"An IAM Split-Privilege Model with Terraform for Robust Cybersecurity\"}),\" was also inspired by this book. It's a fantastic resource for an overview of AWS security architecture design from a 30,000-foot viewpoint.\"]}),(0,e.jsx)(t.p,{children:\"Next, I'd like to touch on the scope of the exam, a bit of technical content. The scope is incredibly broad, with interconnected elements. The exam content is also random, flexible, and combines different services. Below, I mention a few things that I think should be noted.\"}),(0,e.jsxs)(t.ol,{children:[(0,e.jsx)(t.li,{children:(0,e.jsx)(t.p,{children:\"Understand all services, familiarize with important services This could be the most time-consuming yet essential part, understanding the purpose and objective of each service. With key services like EC2, IAM, VPC, S3, you should familiarize yourself with the content as much as possible. Know the purpose of all services mentioned in the Security course and when they are appropriate to use. You don't need to be an expert in all of them, but having a clear understanding can help answer a lot of simple questions quickly. For example, WAF, Shield, CloudFront - it's vital to clearly differentiate between them. Which service is better to block DDOS? Also, services like CloudTrail, CloudWatch, AWS Config, Inspector - these can easily be confused if not well understood.\"})}),(0,e.jsx)(t.li,{children:(0,e.jsxs)(t.p,{children:[\"Understand IAM and policy You must be well-versed with IAM and ACL-related content like the relationships between User, Group, Role, Policy. Understand the three types of Policy - AWS-managed, customer-managed, inline - and the two types of Permissions - \",(0,e.jsx)(t.a,{href:\"https://docs.aws.amazon.com/IAM/latest/UserGuide/access_policies_identity-vs-resource.html\",children:\"Identity-based policies and resource-based policies\"}),\" (plus, SCP is also added). Know the priority order - explicit deny, explicit allow, implicit deny. These are crucial, and you need to fully understand them rather than cramming them.\"]})}),(0,e.jsx)(t.li,{children:(0,e.jsx)(t.p,{children:\"KMS Regarding KMS, understand symmetric and asymmetric CMKs, the purposes of different Keys, storage locations, and Key rotation content. These are elements of a service that can easily cause confusion.\"})}),(0,e.jsx)(t.li,{children:(0,e.jsxs)(t.p,{children:[\"Data Security For this part, you can refer to docs like \",(0,e.jsx)(t.a,{href:\"https://docs.aws.amazon.com/whitepapers/latest/efs-encrypted-file-systems/encryption-of-data-at-rest.html\",children:\"Encryption of Data at Rest\"}),\". For Data Security, you need to differentiate between SSE-KMS, SSE-C, SSE-S3.\"]})}),(0,e.jsx)(t.li,{children:(0,e.jsx)(t.p,{children:\"VPC-related That's a large topic. Amazon Virtual Private Cloud (VPC) is a fundamental component of AWS, providing a virtual network that allows you to launch AWS resources into a logically isolated section of the AWS Cloud. Understanding VPC is crucial for anyone aiming to excel in AWS security. Here are some key aspects to consider:\"})})]}),(0,e.jsxs)(t.ul,{children:[(0,e.jsx)(t.li,{children:\"VPC Basics\"}),(0,e.jsx)(t.li,{children:\"VPC Peering and Transit Gateway\"}),(0,e.jsx)(t.li,{children:\"VPC Endpoints\"}),(0,e.jsx)(t.li,{children:\"Security Groups and Network ACLs\"}),(0,e.jsx)(t.li,{children:\"VPC Flow Logs\"}),(0,e.jsx)(t.li,{children:\"VPC Peering Best Practices\"}),(0,e.jsx)(t.li,{children:\"VPC Security Considerations\"}),(0,e.jsx)(t.li,{children:\"Network Isolation and Segmentation\"}),(0,e.jsx)(t.li,{children:\"AWS PrivateLink\"}),(0,e.jsx)(t.li,{children:\"VPC Peering and Third-Party Appliances\"})]}),(0,e.jsx)(t.p,{children:\"By thoroughly understanding these VPC-related concepts and best practices, you'll be well-prepared to address security concerns and design robust, secure network architectures as part of your AWS Certified Security \\u2013 Specialty exam preparation. VPC is a critical foundation for securing AWS resources, and a strong grasp of its intricacies is essential for success in the field of AWS security.\"}),(0,e.jsx)(t.p,{children:\"The above briefly covers just a few items and directions. After all, the main goal of this post is to share my insights, not to be a technical article.\"})]})}}var A=b;function C(i,r){throw new Error(\"Expected \"+(r?\"component\":\"object\")+\" `\"+i+\"` to be defined: you likely forgot to import, pass, or provide it.\")}return v;})();\n;return Component;","toc":[],"frontMatter":{"readingTime":{"text":"4 min read","minutes":3.71,"time":222600,"words":742},"slug":"general/aws_security_cert","fileName":"general/aws_security_cert.md","title":"AWS Security Specialty: What I Learned Preparing for the Exam","date":"2023-09-24T00:00:00.000Z","tags":["Cloud","AWS"],"draft":false,"summary":"Sharing my exam prep insights and key technical focus areas like IAM, KMS, and VPC to help others prepare for the AWS Security Specialty exam.","images":[]}},"authorDetails":[{"readingTime":{"text":"1 min read","minutes":0.68,"time":40800,"words":136},"slug":["default"],"fileName":"default.md","name":"L.W.J","avatar":"/static/images/avatar.png","occupation":"CISSP, AWS Certified Security – Specialty, Cloud and WASM","email":"bGl3ZWlqaWFuLmh1c3RAZ21haWwuY29t@decode-in-base64","twitter":"https://twitter.com/supasaf","date":null}],"prev":{"title":"Envelope Encryption: Boosting Cloud Security with KMS","date":"2023-07-02T00:00:00.000Z","tags":["Cloud","AWS","Cryptography"],"draft":false,"summary":"Explore envelope encryption and its importance for cloud security, using AWS Key Management Service (KMS) and OpenSSL to protect sensitive data.","images":[],"slug":"general/envelope_encr"},"next":null},"__N_SSG":true}